.cf.xml/Catalogs/обм_ДанныеЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ДанныеЗаполнения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ВходящиеСообщения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_Переопределяемый_Обработчики</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник_JSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Приемники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТипаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикЗаполненияПриемника</Name>
					<Comment>Ссылка на обработчик, которые заполнил СсылкаПриемника. Для справки.</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_Переопределяемый_Обработчики</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/Catalogs/обм_ДанныеЗаполнения/Ext/ManagerModule.bsl
// Функция поиска приемника по умолчанию
Функция НайтиПриемника(пДанныеЗаполненияСсылка) Экспорт
	
	общ.Проверка_Тип(пДанныеЗаполненияСсылка, Тип("СправочникСсылка.обм_ДанныеЗаполнения"));
	
	// 1. Искать ссылку на входящий объект в регистре сведений
	СсылкаПриемник = 
		РегистрыСведений.обм_Приемники.НайтиСсылкуПриемника(
			пДанныеЗаполненияСсылка.Узел,
			пДанныеЗаполненияСсылка.Категория,
			пДанныеЗаполненияСсылка.Идентификатор
			);
			
	Если ЗначениеЗаполнено(СсылкаПриемник) Тогда
		Возврат СсылкаПриемник;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбъект(пВходящееСообщениеВладелец, пУзел, пКатегория, пИдентификатор) Экспорт
	
	общ.Проверка_Тип(пВходящееСообщениеВладелец, Тип("СправочникСсылка.обм_ВходящиеСообщения"));
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен параметр 'узел'";
		
	КонецЕсли;
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен параметр 'категория'";
		
	КонецЕсли;
	
	Если ПустаяСтрока(пИдентификатор) Тогда
		ВызватьИсключение "Не заполнен параметр 'идентификатор'";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("пВходящееСообщениеВладелец", пВходящееСообщениеВладелец);
	Запрос.УстановитьПараметр("Узел", пУзел);
	Запрос.УстановитьПараметр("Категория", пКатегория);
	Запрос.УстановитьПараметр("Идентификатор", пИдентификатор);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДЗ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.обм_ДанныеЗаполнения КАК ДЗ
	|ГДЕ
	|	ДЗ.Владелец = &пВходящееСообщениеВладелец
	|	И ДЗ.Узел = &Узел
	|	И ДЗ.Категория = &Категория
	|	И ДЗ.Идентификатор = &Идентификатор
	|	И ДЗ.Родитель = ЗНАЧЕНИЕ(Справочник.обм_ДанныеЗаполнения.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеЗаполненияОбъект = Неопределено;
	Если Выборка.Следующий() Тогда
		ДанныеЗаполненияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		ДанныеЗаполненияОбъект = Справочники.обм_ДанныеЗаполнения.СоздатьЭлемент();
		
	КонецЕсли; 
	
	ДанныеЗаполненияОбъект.Владелец = пВходящееСообщениеВладелец;
	ДанныеЗаполненияОбъект.ДатаВремя = пВходящееСообщениеВладелец.ДатаВремя;
	ДанныеЗаполненияОбъект.ПометкаУдаления = Ложь;
	ДанныеЗаполненияОбъект.Узел = пУзел;
	ДанныеЗаполненияОбъект.Категория = пКатегория;
	ДанныеЗаполненияОбъект.Идентификатор = пИдентификатор;
	ДанныеЗаполненияОбъект.Данные = Неопределено; 
	
	Возврат ДанныеЗаполненияОбъект;
	
КонецФункции
